Diaries/TechDiaryArvid.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-04-05 ons 13:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="arvid" />
</head>
<body>
<div id="content">
<div id="outline-container-org60339e2" class="outline-2">
<h2 id="org60339e2"><span class="section-number-2">1</span> Teknisk dagbok - Projekt VT 2017</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org4ea6b0a" class="outline-3">
<h3 id="org4ea6b0a"><span class="section-number-3">1.1</span> Arvid Sigvardsson</h3>
</div>
<div id="outline-container-org4121627" class="outline-3">
<h3 id="org4121627"><span class="section-number-3">1.2</span> Datateknik och mobil IT, MAH</h3>
</div>
</div>

<div id="outline-container-org437f3de" class="outline-2">
<h2 id="org437f3de"><span class="section-number-2">2</span> Dagbok</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org1f08830" class="outline-3">
<h3 id="org1f08830"><span class="section-number-3">2.1</span> 2017-04-03</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-org1353b22" class="outline-4">
<h4 id="org1353b22"><span class="section-number-4">2.1.1</span> Teknologier</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Vi brainstormade olika ideer till postitioneringssystem:
</p>
<ol class="org-ol">
<li>Ultraljud</li>
<li>Ultra wide band</li>
<li>Snöre som roboten drar ut, vinkeln och längden bestämmer postitionen</li>
<li>Projicerat färgspektrum</li>
<li>RFID-taggar utplacerade i golvet</li>
<li>INS, inertial navigation system</li>
</ol>
</div>
</div>
<div id="outline-container-org7f59464" class="outline-4">
<h4 id="org7f59464"><span class="section-number-4">2.1.2</span> Indelning och systematisering</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
(1) och (2) är trianguleringsmetoder, medan de andra innebär någon form av fysisk lokalisering. Vi gjorde åtskillnad på centraliserade och decentraliserade system. I de centrala systemen fastställs postitionen centralt av systemet, inte "ombord" på roboten. Detta kräver någon form av trådlös kommunikation till en modul på roboten, t ex wifi eller bluetooth. De decentraliserade lösningarna räknar ut positionen direkt i modulen på roboten.
</p>
</div>
</div>
<div id="outline-container-org20ec2f6" class="outline-4">
<h4 id="org20ec2f6"><span class="section-number-4">2.1.3</span> Andra alternativ</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Vi diskuterade även möjligheten att använda en/flera kameror och utföra någon bildbehandling. En variant är att ha en överblicksbild och indela bilden i ett rutnät. Annan variant är att använda kamera för triangulering. Alla vi i gruppen är lite skeptiska till kameraideerna, lite oklart varför.
</p>
</div>
</div>
<div id="outline-container-orgc8367d5" class="outline-4">
<h4 id="orgc8367d5"><span class="section-number-4">2.1.4</span> Två stycken lösningar</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
Det lutar åt att vi försöker oss på två lösningar som vi arbetar med parallellt, en enklare och en mer avancerad/noggrann. Delvis för att kunna leverera något system i god tid för plattformsgrupperna att testa, men fortfarande kunna leverera ett noggrant system. Delvis för att ha redundancy, om ett system inte fungerar så kan vi använda det andra.
</p>
</div>
</div>
<div id="outline-container-org678e102" class="outline-4">
<h4 id="org678e102"><span class="section-number-4">2.1.5</span> Orientering</h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
Det är inte helt klart i vår uppgiftsbeskrivning om vi ska leverera ett system som räknar ut robotens orientering, alltså i vilken riktning den tittar/kör. Det är klart att det är något som krävs för att klara uppgiften, men det kan vara så att plattformsgrupperna ska hantera detta själva. Jag/vi lutar åt att det är något vi ska utföra. Jag ser tre lösningar på problemet:
</p>
<ul class="org-ul">
<li>gyroskop, tangerar INS ovan</li>
<li>ultraljud med två mikrofoner, och mäta fasskillnad (?) mellan dem</li>
<li>räkna ut orientering mha bildbehandling</li>
</ul>
</div>
</div>
<div id="outline-container-orgb835466" class="outline-4">
<h4 id="orgb835466"><span class="section-number-4">2.1.6</span> Kommunikationsprotokoll</h4>
<div class="outline-text-4" id="text-2-1-6">
<p>
Vi diskuterade med plattformsgrupperna att vi behöver bestämma hur vår positioneringsmodul ska kommunicera med deras styrenheter. Vi vill ha en "standard", alltså samma kommunikation med alla plattformar. Vi diskuterade löst t ex I2C och SPI. Ska försöka ha ett möte snart med representant från varje grupp.
</p>
</div>
</div>
<div id="outline-container-org74c32b1" class="outline-4">
<h4 id="org74c32b1"><span class="section-number-4">2.1.7</span> Oklarheter</h4>
<div class="outline-text-4" id="text-2-1-7">
<ul class="org-ul">
<li>Hur stort område skall vi täcka?</li>
<li>Vilken upplösning behövs?</li>
<li>Vad har vi för budget?</li>
<li>Hur många moduler ska vi bygga? Jag lutar åt 4, en för varje plattform, samt en i backup/för testning. Täcker budgeten detta?</li>
</ul>
</div>
</div>
<div id="outline-container-orgea85cbb" class="outline-4">
<h4 id="orgea85cbb"><span class="section-number-4">2.1.8</span> Gå vidare</h4>
<div class="outline-text-4" id="text-2-1-8">
<p>
Vi ska imorgon träffa Tommy (Andersson) och diskutera olika möjligheter. Efter detta tänker vi oss att vi kan bestämma oss för hur vi går fram.
</p>
</div>
</div>
</div>
<div id="outline-container-org939c81f" class="outline-3">
<h3 id="org939c81f"><span class="section-number-3">2.2</span> 2017-04-04</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-org41bcfa5" class="outline-4">
<h4 id="org41bcfa5"><span class="section-number-4">2.2.1</span> Vi hade möte med Tommy, se <a href="https://github.com/arvidsigvardsson/ValentinaTereshkova/blob/master/MeetingNotes/Tommy2017-04-04.org">anteckningar</a></h4>
<div class="outline-text-4" id="text-2-2-1">
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: arvid</p>
<p class="date">Created: 2017-04-05 ons 13:18</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
